app/views/reservations/your_trips.html.erb

SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT 1  [["id", 1]]
SELECT "photos".* FROM "photos" WHERE "photos"."room_id" = ?  [["room_id", 1]]
---
							<%= link_to room_path(trip.room) do %>
								<%= image_tag trip.room.photos[0].image.url(:thumb) if trip.room.photos.length > 0 %>