app/controllers/messages_controller.rb

	def index
		if current_user == @conversation.sender || current_user == @conversation.recipient
			@other = current_user == @conversation.sender ? @conversation.recipient : @conversation.sender
			@messages = @conversation.messages.order("created_at DESC")
---
SELECT "messages".* FROM "messages" WHERE "messages"."conversation_id" = ?  ORDER BY created_at DESC  [["conversation_id", 1]]

	def create
		@message = @conversation.messages.new(message_params)
		@messages = @conversation.messages.order("created_at DESC")

		if @message.save
---
INSERT INTO "messages" ("content", "user_id", "conversation_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "Hey How are ya\r\n"], ["user_id", 4], ["conversation_id", 1], ["created_at", "2017-04-04 00:45:18.078597"], ["updated_at", "2017-04-04 00:45:18.078597"]]

		def set_conversation
			@conversation = Conversation.find(params[:conversation_id])
---
SELECT  "conversations".* FROM "conversations" WHERE "conversations"."id" = ? LIMIT 1  [["id", 1]]