app/controllers/reservations_controller.rb

SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT 1  [["id", 1]]
SELECT "reservations".* FROM "reservations" WHERE "reservations"."room_id" = ? AND (start_date >= '2017-03-15' OR end_date >= '2017-03-15')  [["room_id", 1]]
---
	def preload
		room = Room.find(params[:room_id])
		today = Date.today
		reservations = room.reservations.where("start_date >= ? OR end_date >= ?", today, today)

INSERT INTO "reservations" ("start_date", "price", "room_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["start_date", "2017-03-16 00:00:00.000000"], ["price", 200], ["room_id", 1], ["user_id", 4], ["created_at", "2017-03-16 01:04:23.296342"], ["updated_at", "2017-03-16 01:04:23.296342"]]
---
	def create
		@reservation = current_user.reservations.create(reservation_params)

SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = ? LIMIT 1  [["id", 7]]
UPDATE "reservations" SET "status" = ?, "updated_at" = ? WHERE "reservations"."id" = ?  [["status", "t"], ["updated_at", "2017-04-07 22:16:51.998930"], ["id", 7]]
---
	def notify
		params.permit!
		status = params[:payment_status]

		reservation = Reservation.find(params[:item_number])

		if status = "Completed"
			reservation.update_attributes status: true

SELECT "reservations".* FROM "reservations" WHERE "reservations"."user_id" = ? AND (status = 't')  [["user_id", 4]]
---
	def your_trips
		@trips = current_user.reservations.where("status = ?", true)