app/controllers/rooms_controller.rb

  def show
    @photos = @room.photos

    @booked = Reservation.where("room_id = ? AND user_id = ?", @room.id, current_user.id).present? if current_user

    @reviews = @room.reviews
    @hasReview = @reviews.find_by(user_id: current_user.id) if current_user
---
SELECT "photos".* FROM "photos" WHERE "photos"."room_id" = ?  [["room_id", 1]]
SELECT "reservations".* FROM "reservations" WHERE (room_id = 1 AND user_id = 4)
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."room_id" = ? AND "reviews"."user_id" = ? LIMIT 1  [["room_id", 1], ["user_id", 4]]

  def create
    @room = current_user.rooms.build(room_params)

    if @room.save

      if params[:images]
        params[:images].each do |image|
          @room.photos.create(image: image)
---
INSERT INTO "rooms" ("home_type", "room_type", "accommodate", "bed_room", "bath_room", "listing_name", "summary", "address", "is_tv", "is_kitchen", "is_air", "is_heating", "is_internet", "price", "active", "user_id", "latitude", "longitude", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "photos" ("image_file_name", "image_content_type", "image_file_size", "image_updated_at", "room_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    if @room.update(room_params)

      if params[:images]
        params[:images].each do |image|
          @room.photos.create(image: image)
---
UPDATE "rooms" SET "address" = ?, "latitude" = ?, "longitude" = ?, "updated_at" = ? WHERE "rooms"."id" = ?  [["address", "1 timbers circle, markham, on , L3S 1E5, Canada"], ["latitude", 43.8406858], ["longitude", -79.284143], ["updated_at", "2017-03-10 10:36:19.930946"], ["id", 1]]
INSERT INTO "photos" ("image_file_name", "image_content_type", "image_file_size", "image_updated_at", "room_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

    def set_room
      @room = Room.find(params[:id])
---
SELECT rooms.*, (69.09332411348201 * ABS(rooms.latitude - 43.8406858) * 0.7071067811865475) + (59.836573914187355 * ABS(rooms.longitude - -79.284143) * 0.7071067811865475) AS distance, CASE WHEN (rooms.latitude >= 43.8406858 AND rooms.longitude >= -79.284143) THEN  45.0 WHEN (rooms.latitude <  43.8406858 AND rooms.longitude >= -79.284143) THEN 135.0 WHEN (rooms.latitude <  43.8406858 AND rooms.longitude <  -79.284143) THEN 225.0 WHEN (rooms.latitude >= 43.8406858 AND rooms.longitude <  -79.284143) THEN 315.0 END AS bearing FROM "rooms" WHERE (rooms.latitude BETWEEN 43.695954016889154 AND 43.98541758311085 AND rooms.longitude BETWEEN -79.48480582137158 AND -79.08348017862842 AND rooms.id != 1)  ORDER BY distance ASC